## Plan Result (1112: sbox_aria - Terraform Plan Apply)




<pre><code>Plan: 2 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.curated_sas_token[&#34;00&#34;]
  * azurerm_key_vault_secret.curated_sas_token[&#34;02&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;02-af-apflpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apl&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.curated_sas_token["00"] will be created
  + resource "azurerm_key_vault_secret" "curated_sas_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
      + name                    = "CURATED-sbox-SAS-TOKEN"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.curated_sas_token["02"] will be created
  + resource "azurerm_key_vault_secret" "curated_sas_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "CURATED-sbox-SAS-TOKEN"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.example["02-af-apflpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apflpa-sbox02-uks-dlrm-01"
        name                                           = "af-apflpa-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apl"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apl-sbox02-uks-dlrm-01"
        name                                           = "af-apl-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox02-uks-dlrm-01"
        name                                           = "af-apluta-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox02-uks-dlrm-01"
        name                                           = "af-bails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox02-uks-dlrm-01"
        name                                           = "af-joh-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox02-uks-dlrm-01"
        name                                           = "af-sbails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01"
        name                                           = "af-td-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 7 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 1112: sbox_aria - Terraform Plan Apply/add-or-update: POST https://api.github.com/repos/hmcts/dlrm-data-ingest-aria/issues/34/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":34,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->